package ru.action_tech.qa.auto.data

enum class Company(
    val companyName: String,
    val inn: String,
    val kpp: String,
    val pin: String,
    val phone: String = "",
    val id: String? = null,
    val bonusLevel: Int = 1
) {
    WEB_DEVELOPMENT_DEPARTMENT("Отдел развития Веб-проектов", "773372600991", "232145554", "4139551001", "9104241786"),
    ORDER_EDIT("ЕРМ НЕ ТРОГАТЬ редактирование заказа", "", "", "5765412201"),
    CHECK_PRICE_AND_BASKET("ЕРМ НЕ ТРОГАТЬ проверяем прайсы и корзины", "", "", "5502473701"),
    SEND_TWO_ACCOUNTS(
        "ЕРМ АВТОМАТИЗАЦИЯ отправляем два счета (не трогать!)",
        "",
        "",
        "5488697801",
        id = "83990C91-7876-4109-8FE3-00409318861A"
    ),
    WORK_WITH_ORDER(
        "ЕРМ AUTOTEST STEPANOV - тестируем работу с заказом (не трогать!)",
        "",
        "",
        "5399109001",
        "",
        "1d0e1580-cd1a-49d8-a7b8-00524700850f"
    ),
    PHONE_CALL_DIAL("ЕРМ тест Автоматизация-тестируем набор звонков (не трогать!!!)", "", "", "5868154801"),
    SEND_LETTER(
        "ЕРМ отправка писем AUTOTEST (не трогать!)",
        "",
        "",
        "5466959701",
        id = "0a6c770d-db60-4267-9311-00656cde9c2b"
    ),
    ROMASHKA(
        companyName = "Ромашка",
        inn = "679494838321",
        kpp = "30042016",
        pin = "4092324101",
        phone = "",
        id = "fac0fde7-69c2-e811-bb9b-00155d627f03"
    ),
    NEVSKAYA_TRAPEZA("ПФ НЕВСКАЯ ТРАПЕЗА", "7838396152", "784101001", "3028390201"),
    GIMNAZIA_33("Гимназия", "1661022012", "166101001", "3007851201"),
    GLOBEKS_BANK(
        companyName = "ГЛОБЭКС Банк",
        inn = "7744001433",
        kpp = "775001001",
        pin = "3009352901",
        id = "26c1ccc6-5b35-4a0f-9c89-92531a80d257"
    ),
    TEST_ADD_CLIENT("Тестовая связываем новых клиентов(не трогать!)", "2105641545", "", "5092812101"),
    SYSTEM_CONSALT("""ООО "СИСТЕМА-КОНСАЛТ"""", "7703248495", "", "3641830001"),
    CONTRACT_MOTOR("КОНТРАКТ МОТОР", "7719893821", "771901001", "2964126901"),
    GOS_BUDGET(
        companyName = """Государственное бюджетное общеобразовательное учреждение города Москвы «Школа с углубленным изучением английского языка № 1238»""",
        inn = "7729783137",
        kpp = "772901001",
        pin = "3042761201",
        phone = "4986008469"
    ),
    UKD_DONT_TOUCH(
        companyName = "ЕРМ Тестируем УКД Не трогать",
        inn = "2990579140",
        kpp = "",
        pin = "5836996201",
        phone = "998299057914",
        id = "76216C68-FB03-4D33-B6AB-0011344B4257"
    ),
    COMPANY_SK("regr26506", "", "", "6179260201"),
    COMPANY_OWN_PK("Тест regr2105", "", "", "6117731901"),
    COMPANY_ALIEN_RK(
        companyName = """ЯКУТСКАЯ ГОРОДСКАЯ НАЦИОНАЛЬНАЯ ГИМНАЗИЯ ИМЕНИ А.Г. И Н.К.ЧИРЯЕВЫХ" ГОРОДСКОГО ОКРУГА "ГОРОД ЯКУТСК""",
        inn = "",
        kpp = "",
        pin = "4781625601"
    ),
    ACTIONS_DEMO_ACCESS(
        companyName = "ЕРМ тест Узбекистан 1246452125 (выдача демодоступа из действия)(выдача демодоступа из действия)(выдача демодоступа из действия)(выдача демодоступа из действия)",
        inn = "",
        kpp = "",
        pin = "6283537001"
    ),
    ORG_CONNECT_DATE("Тест ДемоТ ТестЕРМ", "", "", "6125557801"),
    ORG_TEST_SCHOOL("ЕРМ тест Школы", "", "", "6545135901"),
    FL_TEST_SCHOOL("ЕРМ Тест Школы", "", "", "6545139001"),
    HIDE_UKD("ЕРМ тест (Скрытие УКД)", "", "", "6534090901", "", "3598f478-f33f-4647-bd5d-01e88b5dfbaf"),
    CHANGE_MAINTENANCE("ЕРМ тест (Смена сопровождения)", "", "", "6153426601"),
    UKRAINE_ORG(
        companyName = "ЕРМ НЕ ТРОГАТЬ тест Украина 7157642880",
        inn = "",
        kpp = "",
        pin = "6153426601",
        phone = "",
        id = "3bb8f893-53c2-4e5b-9159-b4dd4f72b623"
    ),
    TEST_CALL_CARD("Тест Карточки Звонка", "", "", "6557110701", "", "69abeafe-4de4-4ffa-94ea-21064ad19400"),
    TEST_PRICE(
        companyName = "ЕРМ  НЕ ТРОГАТЬ  проверяем прайсы и корзины",
        inn = "4494655030",
        kpp = "",
        pin = "5502473701",
        phone = "",
        id = "be9afa7e-d0f5-455f-b54b-0027ee94e2c0"
    ),
    TEST_DD("ЕРМ тест Узбекистан выдача ДД", "871019098", "", "6734793201", "", "219f59c2-4537-4f26-a19c-03e5635a909d"),
    COMPANY_FOR_DEMO(
        companyName = "ЕРМ тест Узбекистан 7284169865",
        inn = "7284169865",
        kpp = "",
        pin = "6970222601",
        phone = "",
        id = "df50d6f1-b518-47ca-a8df-60fdea2a5ac3"
    ),
    TEST_WHITE_LIST(
        companyName = "ЕРМ тест Узбекистан проверка фио",
        inn = "",
        kpp = "",
        pin = "6418420301",
        phone = "",
        id = "5189e257-8f8e-4e70-b7db-063aa10082a8"
    ),
    CHECK_CLIENT_DIVISIONS_TREE("АО \"МОЛВЕСТ\"", "", "", "", "", "0bbcfa35-fd1f-4273-9135-a748e04308b2"),
    CHECK_UNIT_DIRECTION_COMPANY(
        "\"ЧЕРКИЗОВО - ОЦО\"",
        "7724929262",
        "772401001",
        "2975645201",
        "",
        "601290A9-AFCB-49A0-A2B9-99C13A6DA987"
    ),
    ADD_CONTACT(
        companyName = "Тестовая для добавления контакта(не трогать!)",
        inn = "",
        kpp = "",
        pin = "5265574801",
        phone = "",
        id = "71750a25-da80-489e-9df6-007a88b3fd26"
    ),
    PAID_DEMO_ACCESS_COMPANY(
        companyName = "ЕРМ тест регр",
        inn = "",
        kpp = "",
        pin = "6054840301",
        phone = "380311111111",
        id = "1d553fba-b57a-45af-b6d4-f2ef422b237d"
    ),
    UZBEKISTAN_5916483119(
        companyName = "ЕРМ тест Узбекистан 5916483119 apiUpdated",
        inn = "5916483119",
        kpp = "",
        pin = "6828501101",
        phone = "998111111111",
        id = "91196283-59d4-4e15-9370-d8c6cf75c80e"
    ),
    OOO_TEST_SALES_REGISTRATION(
        companyName = "ООО Тестовый Регистрация продаж",
        inn = "",
        kpp = "",
        pin = "7081580701",
        phone = "998789578999",
        id = "0b435e11-1b8b-4009-9e7f-4d4004e6dcfd"
    ),
    UNKNOWN_OR_SPAM(
        companyName = "ServiceDesk Клиент не определен",
        inn = "",
        kpp = "",
        pin = "2777216001",
        phone = "",
        id = "f3b1b870-7ad6-e311-9f4b-78e3b502da44"
    ),
    COMPANY_FOR_SENDING(
        companyName = "НПО \"ВМИ-Координационный Центр Сети Консультант Плюс\"",
        inn = "7736534759",
        kpp = "773601001",
        pin = "11273301",
        phone = "74957879291",
        id = "e793cb15-afc5-4d8a-967a-aef6f94326c0"
    ),

    // FIXME ("Необходимо отказаться от реальных клиентов в тестах")
    RIB_STROI(
        companyName = "РЫБСТРОЙ",
        inn = "7702513905",
        kpp = "770201001",
        pin = "528184301",
        phone = "9778372679",
        id = "58e336fd-b0e5-4efd-aa54-458c1e170bed"
    ),

    ZIRYANOV_AUTOTEST(
        companyName = "ИП Зырянов Д.В. (для автотестов)",
        inn = "701710470428",
        kpp = "",
        pin = "3131890501",
        phone = "9778372679",
        id = "48a23c1b-c582-4cc0-bc01-3a6b324d3bf1"
    )
}